___

<a href='http://www.pieriandata.com'> <img src='./Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

**Import pandas as pd.**

In [131]:
import pandas as pd

**Read Salaries.csv as a dataframe called sal.**

In [132]:
sal = pd.read_csv('Salaries.csv')

**Check the head of the DataFrame.**

In [133]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

**Use the .info() method to find out how many entries there are.**

In [134]:
'''
The .info() method in pandas provides a concise summary of a DataFrame. It’s especially useful for getting a quick overview of the dataset’s structure.
Here's what it shows:
    -Index range (e.g., RangeIndex: 100 entries, 0 to 99)
    -Number of columns
    -Column names
    -Non-null counts (helps you spot missing data)
    -Data types of each column (int64, float64, object, etc.)
    -Memory usage
'''
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [ ]:
sal['BasePay'].mean()
# This is the average base pay of all employees. It tells you where the center of the data lies on average, but it can be skewed by very high or very low salaries.

66325.4488404877

In [ ]:
sal['BasePay'].median()
#This is the middle salary when all salaries are sorted. It's lower than the mean, 
# which is a sign that your data is right-skewed — meaning some employees have very high base pay values that pull the mean upward.

65007.45

In [ ]:
sal['BasePay'].std()
#This is a large standard deviation, indicating that the salaries are widely spread out from the mean. 
# Some people earn far below or above the average.

42764.63549525958

**What is the highest amount of OvertimePay in the dataset?**

In [136]:
sal['OvertimePay'].max()

245131.88

**What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).**

In [137]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [138]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does JOSEPH DRISCOLL make (including benefits)?**

In [139]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

**What is the name of highest paid person (including benefits)?**

In [188]:
sal['TotalPayBenefits'].max()

567595.43

In [140]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [189]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [141]:
sal['TotalPayBenefits'].idxmax()

0

In [191]:
sal['TotalPayBenefits'].argmax()

0

In [142]:
# sal.loc[sal['TotalPayBenefits'].idxmax()]
'''
sal['TotalPayBenefits'].idxmax() returns the index of the row with the maximum value in that column.
sal.loc[...] retrieves the row at that index.
'''
sal.loc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [ ]:
sal.iloc[sal['TotalPayBenefits'].argmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
title_len                                                       46
Name: 0, dtype: object

In [190]:
import numpy as np
s = np.array([1, 4, 6, 7, 0])
s.argmax()

3

**What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [193]:
sal.loc[sal['TotalPayBenefits'].idxmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                   0.0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
title_len                                   26
Name: 148653, dtype: object

In [197]:
sal.iloc[sal['TotalPayBenefits'].argmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                   0.0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
title_len                                   26
Name: 148653, dtype: object

In [143]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [144]:
sal.loc[sal['TotalPayBenefits'].idxmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                   0.0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
Name: 148653, dtype: object

**What was the average (mean) BasePay of all employees per year? (2011-2014)?**

In [145]:
# sal.groupby('Year')['BasePay'].mean()
'''
1) sal.groupby('Year'): This groups the DataFrame 'sal' by the values in the 'Year' column. Each group contains all rows corresponding to a specific year.

2) ['BasePay']: From each group, it selects only the 'BasePay' column.

3).mean(): This computes the mean (average) of 'BasePay' for each year group.
'''
sal.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [146]:
type(sal.groupby('Year')['BasePay'].mean())

pandas.core.series.Series

In [200]:
sal.groupby('Year')['BasePay'].mean()[2013]

69630.03021648063

**How many unique job titles are there?**

In [147]:
sal['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [201]:
len(sal['JobTitle'].unique())

2159

In [148]:
sal['JobTitle'].nunique()

2159

**What are the top 5 most common jobs?**

In [149]:
sal.groupby('JobTitle').size().sort_values(ascending=False).head()
#Or
# sal.groupby('JobTitle').size().sort_values(ascending=False).head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
dtype: int64

In [203]:
# sal['JobTitle'].size().sort_values(ascending=False).head()  #TypeError  
#It is not correct because .size() is not a method of a Series (like sal['JobTitle']). Instead, .size is an attribute used with grouped DataFrames or the entire DataFrame — and it's not callable (no parentheses).

In [150]:
sal['JobTitle'].value_counts().sort_values(ascending=False).head()

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [151]:
sal['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [ ]:
#Both '.value_counts()' and '.size()' give you a count of rows for each unique JobTitle.

In [152]:
#sal.groupby('JobTitle').size() 
#or
#sal['JobTitle'].value_counts()

**How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)**

In [153]:
a = sal['JobTitle'].value_counts() == 1
a.value_counts()

count
False    1920
True      239
Name: count, dtype: int64

In [ ]:
a = sal.groupby('Year')['JobTitle'].value_counts() == 1
# type(a) #pandas.core.series.Series
a[2013].value_counts()
#type(a[2013].value_counts())   #pandas.core.series.Series

count
False    849
True     202
Name: count, dtype: int64

In [167]:
a[2013].value_counts()[True]

202

In [169]:
sal['Year']==2013

0         False
1         False
2         False
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: Year, Length: 148654, dtype: bool

In [172]:
sal[sal['Year']==2013]['JobTitle'].value_counts() == 1

JobTitle
Transit Operator                  False
Special Nurse                     False
Registered Nurse                  False
Public Svc Aide-Public Works      False
Custodian                         False
                                  ...
Sr General Utility Mechanic        True
Sprv Adult Prob Ofc (SFERS)        True
Mayoral Staff XII                  True
Pr Investigator, Tax Collector     True
Senior Assessment Clerk            True
Name: count, Length: 1051, dtype: bool

In [ ]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

In [ ]:
c = pd.Series([True, False, True])
sum(c)  #2

2

**How many people have the word Chief in their job title? (This is pretty tricky)**

In [179]:
# sal['EmployeeName'].str.contains('chief', case=False, na=False)
'''
'chief' is the word you're looking for.
case=False makes the search case-insensitive (matches "Chief", "CHIEF", etc.).
na=False ensures that NaN values are treated as False (to avoid errors).
'''
sal['JobTitle'].str.contains('chief', case=False, na=False).value_counts()[True]

627

477

In [206]:
"rtu, oou".split()

['rtu,', 'oou']

**Bonus: Is there a correlation between length of the Job Title string and Salary?**

In [184]:
w = sal['JobTitle'].apply(len)
sal['title_len'] = w

In [ ]:
sal[['title_len', 'TotalPayBenefits']].corr()   ## No correlation.

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!